Revit 2027 API
RevitLinkGraphicsSettings.ObjectStyles Property
 The object styles of RevitLinkGraphicsSettings. The object styles can be set to ByHostView or ByLinkView.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkVisibility ObjectStyles { get; set; }
Public Property ObjectStyles As LinkVisibility
	Get
	Set
public:
property LinkVisibility ObjectStyles {
	LinkVisibility get ();
	void set (LinkVisibility value);
}
member ObjectStyles : LinkVisibility with get, set
Property Value
LinkVisibility
Exceptions
Exception | Condition
ArgumentException |  When setting this property: Disallowed LinkVisibility value.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace